---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.RegenFailures.UserCancelledError
source: html/e1836b84-15d0-1bf6-2710-ca6c9dcfd858.htm
---
# Autodesk.Revit.DB.BuiltInFailures.RegenFailures.UserCancelledError Property

Operation is cancelled by the user.

## Syntax (C#)
```csharp
public static FailureDefinitionId UserCancelledError { get; }
```